# Напишите программу, которая по заданному номеру четверти, показывает диапазон возможных координат точек в этой четверти (x и y).

quarter_number = int(input('Введите номер четверти (от 1 до 4): '))

if quarter_number == 1:
    print(f'В четверти {quarter_number} х от 0'
          f' до бесконечности, у от 0 до бесконечности')
elif quarter_number == 2:
    print(f'В четверти {quarter_number} х от 0'
          f' до минус бесконечности, у от 0 до бесконечности')
elif quarter_number == 3:
    print(f'В четверти {quarter_number} х от 0'
          f' до минус бесконечности, у от 0 до минус бесконечности')
elif quarter_number == 4:
    print(f'В четверти {quarter_number} х от 0'
          f' до бесконечности, у от 0 до минус бесконечности')
else:
    print('Вы ввели число за пределами заданного диапазона.')